<?php
	
/*
//=============================================================================/
// Open Lamp Engine version 1.0
//-----------------------------------------------------------------------------/
// Web-site: http://www.pamparam.net/ email: openlampengine@gmail.com
//-----------------------------------------------------------------------------/
// Author: r0n9.GOL email: ron9.gol@gmail.com
//-----------------------------------------------------------------------------/
// Copyright by r0n9.GOL © 2009
//=============================================================================/
// Данный код защищен авторскими правами :)
//=============================================================================/
// Файл: lindex.php
//-----------------------------------------------------------------------------/
// Назначение: Язык сайта (русский)
//=============================================================================/
*/
	
	$LANG = array (
	
	'redir_back'  => "Вернуться назад",
	'redir_main'  => "На главную",
	'mess'        => "Сообщение",
	
	'jan' => "Январь",
	'feb' => "Февраль",
	'mar' => "Март",
	'apr' => "Апрель",
	'may' => "Май",
	'jun' => "Июнь",
	'jul' => "Июль",
	'aug' => "Август",
	'sep' => "Сентябрь",
	'oct' => "Октябрь",
	'nov' => "Ноябрь",
	'dec' => "Декабрь",
	
	'jan1' => "Января",
	'feb1' => "Февраля",
	'mar1' => "Марта",
	'apr1' => "Апреля",
	'may1' => "Мая",
	'jun1' => "Июня",
	'jul1' => "Июля",
	'aug1' => "Августа",
	'sep1' => "Сентября",
	'oct1' => "Октября",
	'nov1' => "Ноября",
	'dec1' => "Декабря",
	
	'emodul'         => "Модуль не найден",
	'arhnews_egets'  => "Архивы новостей не найдены",
	'popunews_egets' => "Популярные новости не найдены",
	'vote_egets' 	 => "Опросы не найдены",
	
	'categories_egets' => "Категории новостей не найдены",
	'bookmarks_egets'  => "Закладки пользователя не найдены",
	'start'            => "Главная",
	'arhnews'          => "Архив новостей",
	'categories'       => "Категории новостей",
	'bookmarks'        => "Закладки пользователя",
	
	'news'         => "Новости",
	'news_egets'   => "Новости не найдены",
	'search_egets' => "По вашому запросу нечего не найдено",
	'news_eget'    => "Новость не найдена",
	'news_add'     => "Добавление новости",
	'news_madd'    => "Новость добавлена",
	'news_edit'    => "Редоктирование новости: ",
	'news_medit'   => "Новость отредоктирована",
	'news_del'     => "Удаление новости",
	'news_mdel'    => "Новость удалена",
	
	'statik'       => "Новости",
	'statik_egets' => "Статические страницы не найдены",
	'statik_eget'  => "Статическая страница не найдена",
	'statik_add'   => "Добавление статической страницы",
	'statik_madd'  => "Статическая страница добавлена",
	'statik_edit'  => "Редоктирование статической страницы: ",
	'statik_medit' => "Статическая страница отредоктирована",
	'statik_del'   => "Удаление статической страницы",
	'statik_mdel'  => "Статическая страница удалена",
	
	'comments_add'  => "Добавление комментария",
	'comments_edit' => "Редоктирование комментария",
	
	'pm_res'        => "Входящие сообщения",
	'pm_send'       => "Отправленные сообщения",
	'pm_add'        => "Отправить сообщение",
	'pm_madd'       => "Сообщение отправлено",
	'pm_emadd'      => "Не кому писать сообщение",
	'pm_egets'      => "Сообщения не найдены",
	'pm_eget'       => "Сообщение не найдено",
	'categories'    => "Категории",
	'statik'        => "Статические страницы",
	'captcha'       => "Код безопасности",
	'captcha_input' => "Введите код безопасности",
	'search'        => "Расширенный поиск",
	'profile'       => "Профиль: ",
	'profile_eget'  => "Профиль не найден",
	'profile_email' => "Письмо отправлено",
	'profile_pm'    => "Сообщение отправлено",
	'profile_rp'    => "Профиль отредоктирован",
	'profile_erp'   => "Профиль не отредоктирован (возможно такое имя или email существуют)",
	'statistik'     => "Общая статистика по сайту",
	'bookmarks'     => "Мои закладки",
	'pm'            => "Персональные сообщения",
	'eaccess'       => "Доступ закрыт",
	'image_upload'  => "Загрузка файлов на сервер",
	'registr'       => "Регистрация нового пользователя",
	'registr_eadd'  => "Возможно такое имя или email существуют",
	'registr_add'   => "Благодарим Вас за регистрацию на нашем сайте! Теперь Вы можете войти на сайт, используя Ваш логин и пароль.",
	
	'wrong_input'   => "Обязательные поля не заполнены, неправельно заполнены",
	'lostpass'      => "Восстановление забытого пароля",
	'registr_emme'  => "Требуется реальность всех вводимых E-mail адресов. На ваш E-mail отправлено письмо с инструкциями следующего шага.",
	'lostpass_emme' => "В связи с тем что в целях безопасности все пароли хранятся в зашифрованном виде, мы не можем восстановить Ваш старый пароль. На ваш E-mail отправлено письмо с инструкциями следующего шага.",
	'lostpass_ok'   => "Согласно Вашему запросу для Вас был сгенерирован новый пароль. Для входа на сайт используйте следующие данные",
	'lostpass_eok'  => "Ссылку востоновления пароля усторела попробывайте еще раз востоновить пароль.",
	'registr_ok'    => "Благодарим Вас за регистрацию на нашем сайте! Теперь Вы можете войти на сайт, используя Ваш логин и пароль.",
	'registr_eok'   => "Активационая ссылку усторела попробывайте еще раз зарегестрироватся.",
	'registr_admax' => "В данный момент заприщена ригистрация или максимизировано количество пользователей.",
	
	'login'         => "Логин",
	'pass'          => "Пароль",
	'comm'          => "Комментарии",
	'news_fs'       => "Подробнее",
	'bookmarks_add' => "Добавить в закладки",
	'bookmarks_del' => "Убрать из закладок",
	'rate_1'        => "Плохо",
	'rate_2'        => "Приемлемо",
	'rate_3'        => "Средне",
	'rate_4'        => "Хорошо",
	'rate_5'        => "Отлично",
	'del'           => "удалить",
	'edit'          => "изменить",
	'spriv'         => "Назад",
	'snext'         => "Вперед",
	'yes'           => "Да",
	'no'            => "Нет",
	
	'arhnews_ymd'  => "Новости за",
	'arhnews_year' => "года",
	
	'cs_onoff'	=> "Сайт выключен",
	'cs_mysql'	=> "MySQL ошибка",
	'cs_mmysql'	=> "Ошибка при подключении к базе данных",
	'cs_ip'		=> "IP заблокирован",
	'cs_mip'	=> "Ваш IP был заблокирован администратором"						
		
	);
?>
