<?php

/*
//=============================================================================/
// Open Lamp Engine version 1.0
//-----------------------------------------------------------------------------/
// Web-site: http://www.pamparam.net/ email: openlampengine@gmail.com
//-----------------------------------------------------------------------------/
// Author: r0n9.GOL email: ron9.gol@gmail.com
//-----------------------------------------------------------------------------/
// Copyright by r0n9.GOL © 2009
//=============================================================================/
// Данный код защищен авторскими правами :)
//=============================================================================/
// Файл: captcha.php
//-----------------------------------------------------------------------------/
// Назначение: Модуль вывода антибот кода
//=============================================================================/
*/

	if (!defined("OLE")) die("<script>window.location = \"./\"</script>");
	
	include(CLASSES ."/captcha.class.php");
	
	$o_captcha = new captcha();

	$o_captcha->genString();

	$_SESSION['captcha'] = $o_captcha->keystring;

	$o_captcha->genImage();

?>
