<?php
	
/*
//=============================================================================/
// Open Lamp Engine version 1.0
//-----------------------------------------------------------------------------/
// Web-site: http://www.pamparam.net/ email: openlampengine@gmail.com
//-----------------------------------------------------------------------------/
// Author: r0n9.GOL email: ron9.gol@gmail.com
//-----------------------------------------------------------------------------/
// Copyright by r0n9.GOL © 2009
//=============================================================================/
// Данный код защищен авторскими правами :)
//=============================================================================/
// Файл: note.class.php
//-----------------------------------------------------------------------------/
// Назначение: Класс управления блокнотом
//=============================================================================/
*/
    
    class note {
    	var $mysql, $tn = NOTE;

        function note($mysql_obj) {
            $this->mysql = $mysql_obj;
        }
                
        function get() {
        	
        	$sql = "select text from $this->tn";
            return $this->mysql->result($sql);
    	}
                
        function update($text) {
        	
        	$sql = "update $this->tn set text='$text'";
            if (!$this->mysql->query($sql)) return FALSE;
			
			return TRUE;
        }
	}
    		
?>
